import torch
import torch.nn as nn
import torch.nn.functional as F

# 固定随机种子
# 每次运行程序都会生成相同的随机数，方便调试和学习
torch.manual_seed(123)


# 创建一个示例 batch
# 2 个样本，每个样本 5 个特征
batch_example = torch.randn(2, 5)

linear = nn.Linear(5, 6)
y = linear(batch_example)
print("\nLinear输出：")
print(y)

z = F.relu(y)
print("\nReLU输出：")
print(z)


# ==========================================================
# 创建一批输入数据（batch）
# ==========================================================
# torch.randn(2, 5)
# 生成一个形状为 (2,5) 的张量
# 2 表示 batch_size = 2
# 即：一次输入两个样本
# 5 表示每个样本有5个特征（feature）
# 例如可能生成：
# [
#   [-0.1115,  0.1204, -0.3696, -0.2404, -1.1969],
#   [ 0.2093, -0.9724, -0.7550,  0.3239, -0.1085]
# ]
# ==========================================================
# 定义一个简单神经网络
# ==========================================================
layer = nn.Sequential(
    # Linear(5,6)
    # 全连接层
    # 输入5维
    # 输出6维
    # 内部会自动学习：
    # weight：大小 (6,5)
    # bias：大小 (6)
    # 每个样本都会执行：
    # y = xW^T + b
    # nn.Linear(5, 6),  # 新创建了一套新Linear,会导致随机数不一样，结果也不一样
    linear,             # 使用同一个对象
    # ReLU 激活函数
    # 小于0全部变成0
    # 大于0保持不变
    # 例如
    # [-2, 3, -1, 5]
    # 变成
    # [0, 3, 0, 5]
    nn.ReLU()
)

# ==========================================================
# 前向计算
# ==========================================================
# batch_example形状：
# (2,5)
# 经过 Linear(5->6)
# 输出变成
# (2,6)
# 再经过 ReLU
# 形状不会改变
#
out = layer(batch_example)

print("Linear + ReLU 输出：")
print(out)
